grevaillot/svd_tools/headers/STM32H7x7_CM4/hsem.h
/** @defgroup hsem_hsem_r14 HSEMR14 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R14_LOCK Lock indication **/
#define HSEM_HSEM_R14_LOCK		(1 << 31)

#define HSEM_HSEM_R14_COREID_SHIFT		8
#define HSEM_HSEM_R14_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r14_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R14_PROCID_SHIFT		0
#define HSEM_HSEM_R14_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r14_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r15 HSEMR15 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R15_LOCK Lock indication **/
#define HSEM_HSEM_R15_LOCK		(1 << 31)

#define HSEM_HSEM_R15_COREID_SHIFT		8
#define HSEM_HSEM_R15_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r15_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R15_PROCID_SHIFT		0
#define HSEM_HSEM_R15_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r15_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r16 HSEMR16 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R16_LOCK Lock indication **/
#define HSEM_HSEM_R16_LOCK		(1 << 31)

#define HSEM_HSEM_R16_COREID_SHIFT		8
#define HSEM_HSEM_R16_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r16_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R16_PROCID_SHIFT		0
#define HSEM_HSEM_R16_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r16_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r17 HSEMR17 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R17_LOCK Lock indication **/
#define HSEM_HSEM_R17_LOCK		(1 << 31)

#define HSEM_HSEM_R17_COREID_SHIFT		8
#define HSEM_HSEM_R17_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r17_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R17_PROCID_SHIFT		0
#define HSEM_HSEM_R17_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r17_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r18 HSEMR18 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R18_LOCK Lock indication **/
#define HSEM_HSEM_R18_LOCK		(1 << 31)

#define HSEM_HSEM_R18_COREID_SHIFT		8
#define HSEM_HSEM_R18_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r18_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R18_PROCID_SHIFT		0
#define HSEM_HSEM_R18_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r18_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r19 HSEMR19 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R19_LOCK Lock indication **/
#define HSEM_HSEM_R19_LOCK		(1 << 31)

#define HSEM_HSEM_R19_COREID_SHIFT		8
#define HSEM_HSEM_R19_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r19_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R19_PROCID_SHIFT		0
#define HSEM_HSEM_R19_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r19_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r20 HSEMR20 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R20_LOCK Lock indication **/
#define HSEM_HSEM_R20_LOCK		(1 << 31)

#define HSEM_HSEM_R20_COREID_SHIFT		8
#define HSEM_HSEM_R20_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r20_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R20_PROCID_SHIFT		0
#define HSEM_HSEM_R20_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r20_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r21 HSEMR21 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R21_LOCK Lock indication **/
#define HSEM_HSEM_R21_LOCK		(1 << 31)

#define HSEM_HSEM_R21_COREID_SHIFT		8
#define HSEM_HSEM_R21_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r21_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R21_PROCID_SHIFT		0
#define HSEM_HSEM_R21_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r21_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r22 HSEMR22 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R22_LOCK Lock indication **/
#define HSEM_HSEM_R22_LOCK		(1 << 31)

#define HSEM_HSEM_R22_COREID_SHIFT		8
#define HSEM_HSEM_R22_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r22_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R22_PROCID_SHIFT		0
#define HSEM_HSEM_R22_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r22_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r23 HSEMR23 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R23_LOCK Lock indication **/
#define HSEM_HSEM_R23_LOCK		(1 << 31)

#define HSEM_HSEM_R23_COREID_SHIFT		8
#define HSEM_HSEM_R23_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r23_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R23_PROCID_SHIFT		0
#define HSEM_HSEM_R23_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r23_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r24 HSEMR24 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R24_LOCK Lock indication **/
#define HSEM_HSEM_R24_LOCK		(1 << 31)

#define HSEM_HSEM_R24_COREID_SHIFT		8
#define HSEM_HSEM_R24_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r24_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R24_PROCID_SHIFT		0
#define HSEM_HSEM_R24_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r24_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r25 HSEMR25 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R25_LOCK Lock indication **/
#define HSEM_HSEM_R25_LOCK		(1 << 31)

#define HSEM_HSEM_R25_COREID_SHIFT		8
#define HSEM_HSEM_R25_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r25_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R25_PROCID_SHIFT		0
#define HSEM_HSEM_R25_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r25_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r26 HSEMR26 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R26_LOCK Lock indication **/
#define HSEM_HSEM_R26_LOCK		(1 << 31)

#define HSEM_HSEM_R26_COREID_SHIFT		8
#define HSEM_HSEM_R26_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r26_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R26_PROCID_SHIFT		0
#define HSEM_HSEM_R26_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r26_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

