grevaillot/svd_tools/headers/STM32H7x7_CM4/hsem.h
/** @defgroup hsem_hsem_r27 HSEMR27 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R27_LOCK Lock indication **/
#define HSEM_HSEM_R27_LOCK		(1 << 31)

#define HSEM_HSEM_R27_COREID_SHIFT		8
#define HSEM_HSEM_R27_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r27_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R27_PROCID_SHIFT		0
#define HSEM_HSEM_R27_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r27_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r28 HSEMR28 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R28_LOCK Lock indication **/
#define HSEM_HSEM_R28_LOCK		(1 << 31)

#define HSEM_HSEM_R28_COREID_SHIFT		8
#define HSEM_HSEM_R28_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r28_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R28_PROCID_SHIFT		0
#define HSEM_HSEM_R28_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r28_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r29 HSEMR29 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R29_LOCK Lock indication **/
#define HSEM_HSEM_R29_LOCK		(1 << 31)

#define HSEM_HSEM_R29_COREID_SHIFT		8
#define HSEM_HSEM_R29_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r29_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R29_PROCID_SHIFT		0
#define HSEM_HSEM_R29_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r29_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r30 HSEMR30 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R30_LOCK Lock indication **/
#define HSEM_HSEM_R30_LOCK		(1 << 31)

#define HSEM_HSEM_R30_COREID_SHIFT		8
#define HSEM_HSEM_R30_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r30_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R30_PROCID_SHIFT		0
#define HSEM_HSEM_R30_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r30_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_r31 HSEMR31 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_HSEM_R31_LOCK Lock indication **/
#define HSEM_HSEM_R31_LOCK		(1 << 31)

#define HSEM_HSEM_R31_COREID_SHIFT		8
#define HSEM_HSEM_R31_COREID_MASK		0x0f
/** @defgroup hsem_hsem_r31_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_R31_PROCID_SHIFT		0
#define HSEM_HSEM_R31_PROCID_MASK		0xff
/** @defgroup hsem_hsem_r31_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr0 HSEMRLR0 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR0_LOCK Lock indication **/
#define HSEM_HSEM_RLR0_LOCK		(1 << 31)

#define HSEM_HSEM_RLR0_COREID_SHIFT		8
#define HSEM_HSEM_RLR0_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr0_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR0_PROCID_SHIFT		0
#define HSEM_HSEM_RLR0_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr0_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr1 HSEMRLR1 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR1_LOCK Lock indication **/
#define HSEM_HSEM_RLR1_LOCK		(1 << 31)

#define HSEM_HSEM_RLR1_COREID_SHIFT		8
#define HSEM_HSEM_RLR1_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr1_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR1_PROCID_SHIFT		0
#define HSEM_HSEM_RLR1_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr1_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr2 HSEMRLR2 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR2_LOCK Lock indication **/
#define HSEM_HSEM_RLR2_LOCK		(1 << 31)

#define HSEM_HSEM_RLR2_COREID_SHIFT		8
#define HSEM_HSEM_RLR2_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr2_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR2_PROCID_SHIFT		0
#define HSEM_HSEM_RLR2_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr2_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr3 HSEMRLR3 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR3_LOCK Lock indication **/
#define HSEM_HSEM_RLR3_LOCK		(1 << 31)

#define HSEM_HSEM_RLR3_COREID_SHIFT		8
#define HSEM_HSEM_RLR3_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr3_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR3_PROCID_SHIFT		0
#define HSEM_HSEM_RLR3_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr3_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr4 HSEMRLR4 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR4_LOCK Lock indication **/
#define HSEM_HSEM_RLR4_LOCK		(1 << 31)

#define HSEM_HSEM_RLR4_COREID_SHIFT		8
#define HSEM_HSEM_RLR4_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr4_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR4_PROCID_SHIFT		0
#define HSEM_HSEM_RLR4_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr4_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr5 HSEMRLR5 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR5_LOCK Lock indication **/
#define HSEM_HSEM_RLR5_LOCK		(1 << 31)

#define HSEM_HSEM_RLR5_COREID_SHIFT		8
#define HSEM_HSEM_RLR5_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr5_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR5_PROCID_SHIFT		0
#define HSEM_HSEM_RLR5_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr5_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr6 HSEMRLR6 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR6_LOCK Lock indication **/
#define HSEM_HSEM_RLR6_LOCK		(1 << 31)

#define HSEM_HSEM_RLR6_COREID_SHIFT		8
#define HSEM_HSEM_RLR6_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr6_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR6_PROCID_SHIFT		0
#define HSEM_HSEM_RLR6_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr6_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr7 HSEMRLR7 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR7_LOCK Lock indication **/
#define HSEM_HSEM_RLR7_LOCK		(1 << 31)

#define HSEM_HSEM_RLR7_COREID_SHIFT		8
#define HSEM_HSEM_RLR7_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr7_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR7_PROCID_SHIFT		0
#define HSEM_HSEM_RLR7_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr7_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr8 HSEMRLR8 HSEM Read lock register
@{*/

