grevaillot/svd_tools/headers/STM32H7x7_CM4/hsem.h
/** HSEM_HSEM_RLR8_LOCK Lock indication **/
#define HSEM_HSEM_RLR8_LOCK		(1 << 31)

#define HSEM_HSEM_RLR8_COREID_SHIFT		8
#define HSEM_HSEM_RLR8_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr8_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR8_PROCID_SHIFT		0
#define HSEM_HSEM_RLR8_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr8_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr9 HSEMRLR9 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR9_LOCK Lock indication **/
#define HSEM_HSEM_RLR9_LOCK		(1 << 31)

#define HSEM_HSEM_RLR9_COREID_SHIFT		8
#define HSEM_HSEM_RLR9_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr9_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR9_PROCID_SHIFT		0
#define HSEM_HSEM_RLR9_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr9_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr10 HSEMRLR10 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR10_LOCK Lock indication **/
#define HSEM_HSEM_RLR10_LOCK		(1 << 31)

#define HSEM_HSEM_RLR10_COREID_SHIFT		8
#define HSEM_HSEM_RLR10_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr10_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR10_PROCID_SHIFT		0
#define HSEM_HSEM_RLR10_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr10_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr11 HSEMRLR11 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR11_LOCK Lock indication **/
#define HSEM_HSEM_RLR11_LOCK		(1 << 31)

#define HSEM_HSEM_RLR11_COREID_SHIFT		8
#define HSEM_HSEM_RLR11_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr11_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR11_PROCID_SHIFT		0
#define HSEM_HSEM_RLR11_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr11_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr12 HSEMRLR12 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR12_LOCK Lock indication **/
#define HSEM_HSEM_RLR12_LOCK		(1 << 31)

#define HSEM_HSEM_RLR12_COREID_SHIFT		8
#define HSEM_HSEM_RLR12_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr12_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR12_PROCID_SHIFT		0
#define HSEM_HSEM_RLR12_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr12_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr13 HSEMRLR13 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR13_LOCK Lock indication **/
#define HSEM_HSEM_RLR13_LOCK		(1 << 31)

#define HSEM_HSEM_RLR13_COREID_SHIFT		8
#define HSEM_HSEM_RLR13_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr13_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR13_PROCID_SHIFT		0
#define HSEM_HSEM_RLR13_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr13_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr14 HSEMRLR14 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR14_LOCK Lock indication **/
#define HSEM_HSEM_RLR14_LOCK		(1 << 31)

#define HSEM_HSEM_RLR14_COREID_SHIFT		8
#define HSEM_HSEM_RLR14_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr14_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR14_PROCID_SHIFT		0
#define HSEM_HSEM_RLR14_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr14_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr15 HSEMRLR15 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR15_LOCK Lock indication **/
#define HSEM_HSEM_RLR15_LOCK		(1 << 31)

#define HSEM_HSEM_RLR15_COREID_SHIFT		8
#define HSEM_HSEM_RLR15_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr15_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR15_PROCID_SHIFT		0
#define HSEM_HSEM_RLR15_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr15_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr16 HSEMRLR16 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR16_LOCK Lock indication **/
#define HSEM_HSEM_RLR16_LOCK		(1 << 31)

#define HSEM_HSEM_RLR16_COREID_SHIFT		8
#define HSEM_HSEM_RLR16_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr16_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR16_PROCID_SHIFT		0
#define HSEM_HSEM_RLR16_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr16_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr17 HSEMRLR17 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR17_LOCK Lock indication **/
#define HSEM_HSEM_RLR17_LOCK		(1 << 31)

#define HSEM_HSEM_RLR17_COREID_SHIFT		8
#define HSEM_HSEM_RLR17_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr17_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR17_PROCID_SHIFT		0
#define HSEM_HSEM_RLR17_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr17_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr18 HSEMRLR18 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR18_LOCK Lock indication **/
#define HSEM_HSEM_RLR18_LOCK		(1 << 31)

#define HSEM_HSEM_RLR18_COREID_SHIFT		8
#define HSEM_HSEM_RLR18_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr18_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR18_PROCID_SHIFT		0
#define HSEM_HSEM_RLR18_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr18_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr19 HSEMRLR19 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR19_LOCK Lock indication **/
#define HSEM_HSEM_RLR19_LOCK		(1 << 31)

#define HSEM_HSEM_RLR19_COREID_SHIFT		8
#define HSEM_HSEM_RLR19_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr19_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR19_PROCID_SHIFT		0
#define HSEM_HSEM_RLR19_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr19_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr20 HSEMRLR20 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR20_LOCK Lock indication **/
#define HSEM_HSEM_RLR20_LOCK		(1 << 31)

#define HSEM_HSEM_RLR20_COREID_SHIFT		8
#define HSEM_HSEM_RLR20_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr20_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR20_PROCID_SHIFT		0
#define HSEM_HSEM_RLR20_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr20_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr21 HSEMRLR21 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR21_LOCK Lock indication **/
#define HSEM_HSEM_RLR21_LOCK		(1 << 31)

#define HSEM_HSEM_RLR21_COREID_SHIFT		8
#define HSEM_HSEM_RLR21_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr21_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR21_PROCID_SHIFT		0
#define HSEM_HSEM_RLR21_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr21_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr22 HSEMRLR22 HSEM Read lock register
@{*/

/** HSEM_HSEM_RLR22_LOCK Lock indication **/
#define HSEM_HSEM_RLR22_LOCK		(1 << 31)

#define HSEM_HSEM_RLR22_COREID_SHIFT		8
#define HSEM_HSEM_RLR22_COREID_MASK		0x0f
/** @defgroup hsem_hsem_rlr22_coreid COREID Semaphore CoreID
@{*/
/**@}*/


#define HSEM_HSEM_RLR22_PROCID_SHIFT		0
#define HSEM_HSEM_RLR22_PROCID_MASK		0xff
/** @defgroup hsem_hsem_rlr22_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_rlr23 HSEMRLR23 HSEM Read lock register
@{*/

