grevaillot/svd_tools/headers/STM32H7x7_CM4/hsem.h
/** @defgroup hsem_hsem_icr HSEMICR HSEM Interrupt clear register
@{*/

/** HSEM_HSEM_ICR_ISCM31 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM31		(1 << 31)
/** HSEM_HSEM_ICR_ISCM30 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM30		(1 << 30)
/** HSEM_HSEM_ICR_ISCM29 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM29		(1 << 29)
/** HSEM_HSEM_ICR_ISCM28 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM28		(1 << 28)
/** HSEM_HSEM_ICR_ISCM27 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM27		(1 << 27)
/** HSEM_HSEM_ICR_ISCM26 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM26		(1 << 26)
/** HSEM_HSEM_ICR_ISCM25 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM25		(1 << 25)
/** HSEM_HSEM_ICR_ISCM24 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM24		(1 << 24)
/** HSEM_HSEM_ICR_ISCM23 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM23		(1 << 23)
/** HSEM_HSEM_ICR_ISCM22 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM22		(1 << 22)
/** HSEM_HSEM_ICR_ISCM21 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM21		(1 << 21)
/** HSEM_HSEM_ICR_ISCM20 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM20		(1 << 20)
/** HSEM_HSEM_ICR_ISCM19 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM19		(1 << 19)
/** HSEM_HSEM_ICR_ISCM18 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM18		(1 << 18)
/** HSEM_HSEM_ICR_ISCM17 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM17		(1 << 17)
/** HSEM_HSEM_ICR_ISCM16 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM16		(1 << 16)
/** HSEM_HSEM_ICR_ISCM15 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM15		(1 << 15)
/** HSEM_HSEM_ICR_ISCM14 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM14		(1 << 14)
/** HSEM_HSEM_ICR_ISCM13 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM13		(1 << 13)
/** HSEM_HSEM_ICR_ISCM12 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM12		(1 << 12)
/** HSEM_HSEM_ICR_ISCM11 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM11		(1 << 11)
/** HSEM_HSEM_ICR_ISCM10 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM10		(1 << 10)
/** HSEM_HSEM_ICR_ISCM9 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM9		(1 << 9)
/** HSEM_HSEM_ICR_ISCM8 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM8		(1 << 8)
/** HSEM_HSEM_ICR_ISCM7 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM7		(1 << 7)
/** HSEM_HSEM_ICR_ISCM6 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM6		(1 << 6)
/** HSEM_HSEM_ICR_ISCM5 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM5		(1 << 5)
/** HSEM_HSEM_ICR_ISCM4 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM4		(1 << 4)
/** HSEM_HSEM_ICR_ISCM3 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM3		(1 << 3)
/** HSEM_HSEM_ICR_ISCM2 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM2		(1 << 2)
/** HSEM_HSEM_ICR_ISCM1 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM1		(1 << 1)
/** HSEM_HSEM_ICR_ISCM0 Interrupt(N) semaphore n clear bit **/
#define HSEM_HSEM_ICR_ISCM0		(1 << 0)

/**@}*/

/** @defgroup hsem_hsem_isr HSEMISR HSEM Interrupt status register
@{*/

/** HSEM_HSEM_ISR_ISFM31 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM31		(1 << 31)
/** HSEM_HSEM_ISR_ISFM30 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM30		(1 << 30)
/** HSEM_HSEM_ISR_ISFM29 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM29		(1 << 29)
/** HSEM_HSEM_ISR_ISFM28 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM28		(1 << 28)
/** HSEM_HSEM_ISR_ISFM27 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM27		(1 << 27)
/** HSEM_HSEM_ISR_ISFM26 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM26		(1 << 26)
/** HSEM_HSEM_ISR_ISFM25 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM25		(1 << 25)
/** HSEM_HSEM_ISR_ISFM24 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM24		(1 << 24)
/** HSEM_HSEM_ISR_ISFM23 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM23		(1 << 23)
/** HSEM_HSEM_ISR_ISFM22 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM22		(1 << 22)
/** HSEM_HSEM_ISR_ISFM21 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM21		(1 << 21)
/** HSEM_HSEM_ISR_ISFM20 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM20		(1 << 20)
/** HSEM_HSEM_ISR_ISFM19 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM19		(1 << 19)
/** HSEM_HSEM_ISR_ISFM18 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM18		(1 << 18)
/** HSEM_HSEM_ISR_ISFM17 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM17		(1 << 17)
/** HSEM_HSEM_ISR_ISFM16 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM16		(1 << 16)
/** HSEM_HSEM_ISR_ISFM15 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM15		(1 << 15)
/** HSEM_HSEM_ISR_ISFM14 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM14		(1 << 14)
/** HSEM_HSEM_ISR_ISFM13 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM13		(1 << 13)
/** HSEM_HSEM_ISR_ISFM12 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM12		(1 << 12)
/** HSEM_HSEM_ISR_ISFM11 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM11		(1 << 11)
/** HSEM_HSEM_ISR_ISFM10 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM10		(1 << 10)
/** HSEM_HSEM_ISR_ISFM9 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM9		(1 << 9)
/** HSEM_HSEM_ISR_ISFM8 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM8		(1 << 8)
/** HSEM_HSEM_ISR_ISFM7 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM7		(1 << 7)
/** HSEM_HSEM_ISR_ISFM6 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM6		(1 << 6)
/** HSEM_HSEM_ISR_ISFM5 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM5		(1 << 5)
/** HSEM_HSEM_ISR_ISFM4 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM4		(1 << 4)
/** HSEM_HSEM_ISR_ISFM3 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM3		(1 << 3)
/** HSEM_HSEM_ISR_ISFM2 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM2		(1 << 2)
/** HSEM_HSEM_ISR_ISFM1 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM1		(1 << 1)
/** HSEM_HSEM_ISR_ISFM0 Interrupt(N) semaphore n status bit before enable (mask). **/
#define HSEM_HSEM_ISR_ISFM0		(1 << 0)

/**@}*/

/** @defgroup hsem_hsem_misr HSEMMISR HSEM Masked interrupt status register
@{*/

/** HSEM_HSEM_MISR_MISF31 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF31		(1 << 31)
/** HSEM_HSEM_MISR_MISF30 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF30		(1 << 30)
/** HSEM_HSEM_MISR_MISF29 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF29		(1 << 29)
/** HSEM_HSEM_MISR_MISF28 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF28		(1 << 28)
/** HSEM_HSEM_MISR_MISF27 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF27		(1 << 27)
/** HSEM_HSEM_MISR_MISF26 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF26		(1 << 26)
/** HSEM_HSEM_MISR_MISF25 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF25		(1 << 25)
/** HSEM_HSEM_MISR_MISF24 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF24		(1 << 24)
/** HSEM_HSEM_MISR_MISF23 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF23		(1 << 23)
/** HSEM_HSEM_MISR_MISF22 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF22		(1 << 22)
/** HSEM_HSEM_MISR_MISF21 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF21		(1 << 21)
/** HSEM_HSEM_MISR_MISF20 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF20		(1 << 20)
/** HSEM_HSEM_MISR_MISF19 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF19		(1 << 19)
/** HSEM_HSEM_MISR_MISF18 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF18		(1 << 18)
/** HSEM_HSEM_MISR_MISF17 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF17		(1 << 17)
/** HSEM_HSEM_MISR_MISF16 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF16		(1 << 16)
/** HSEM_HSEM_MISR_MISF15 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF15		(1 << 15)
/** HSEM_HSEM_MISR_MISF14 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF14		(1 << 14)
/** HSEM_HSEM_MISR_MISF13 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF13		(1 << 13)
/** HSEM_HSEM_MISR_MISF12 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF12		(1 << 12)
/** HSEM_HSEM_MISR_MISF11 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF11		(1 << 11)
/** HSEM_HSEM_MISR_MISF10 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF10		(1 << 10)
/** HSEM_HSEM_MISR_MISF9 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF9		(1 << 9)
/** HSEM_HSEM_MISR_MISF8 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF8		(1 << 8)
/** HSEM_HSEM_MISR_MISF7 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF7		(1 << 7)
/** HSEM_HSEM_MISR_MISF6 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF6		(1 << 6)
/** HSEM_HSEM_MISR_MISF5 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF5		(1 << 5)
/** HSEM_HSEM_MISR_MISF4 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF4		(1 << 4)
/** HSEM_HSEM_MISR_MISF3 masked interrupt(N) semaphore n status bit after enable (mask). **/
#define HSEM_HSEM_MISR_MISF3		(1 << 3)
/** HSEM_HSEM_MISR_MISF2 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_HSEM_MISR_MISF2		(1 << 2)
/** HSEM_HSEM_MISR_MISF1 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_HSEM_MISR_MISF1		(1 << 1)
/** HSEM_HSEM_MISR_MISF0 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_HSEM_MISR_MISF0		(1 << 0)

/**@}*/

/** @defgroup hsem_hsem_cr HSEMCR HSEM Clear register
@{*/


#define HSEM_HSEM_CR_KEY_SHIFT		16
#define HSEM_HSEM_CR_KEY_MASK		0xffff
/** @defgroup hsem_hsem_cr_key KEY Semaphore clear Key
@{*/
/**@}*/


#define HSEM_HSEM_CR_MASTERID_SHIFT		8
#define HSEM_HSEM_CR_MASTERID_MASK		0x0f
/** @defgroup hsem_hsem_cr_masterid MASTERID MasterID of semaphores to be cleared
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_hsem_keyr HSEMKEYR HSEM Interrupt clear register
@{*/


#define HSEM_HSEM_KEYR_KEY_SHIFT		16
#define HSEM_HSEM_KEYR_KEY_MASK		0xffff
/** @defgroup hsem_hsem_keyr_key KEY Semaphore Clear Key
@{*/
/**@}*/


/**@}*/
